{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv0",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "data",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage1_0\/conv1",
      "blob_weights" : 7,
      "K" : 24,
      "blob_biases" : 5,
      "stride_x" : 2,
      "name" : "stage1_0\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage1_0\/conv2",
      "blob_weights" : 11,
      "K" : 32,
      "blob_biases" : 9,
      "name" : "stage1_0\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "stage1_0\/conv1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage1\/downsample",
      "blob_weights" : 15,
      "K" : 24,
      "blob_biases" : 13,
      "stride_x" : 2,
      "name" : "stage1\/downsample",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "stage1_0\/conv2,stage1\/downsample",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "stage1_0\/sum",
      "type" : "elementwise",
      "name" : "stage1_0\/sum",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage2_0\/conv1",
      "blob_weights" : 19,
      "K" : 32,
      "blob_biases" : 17,
      "stride_x" : 2,
      "name" : "stage2_0\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "stage1_0\/sum",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage2_0\/conv2",
      "blob_weights" : 23,
      "K" : 44,
      "blob_biases" : 21,
      "name" : "stage2_0\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "stage2_0\/conv1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage2\/downsample",
      "blob_weights" : 27,
      "K" : 32,
      "blob_biases" : 25,
      "stride_x" : 2,
      "name" : "stage2\/downsample",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "stage1_0\/sum",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "stage2_0\/conv2,stage2\/downsample",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "stage2_0\/sum",
      "type" : "elementwise",
      "name" : "stage2_0\/sum",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage2_1\/conv1",
      "blob_weights" : 31,
      "K" : 44,
      "blob_biases" : 29,
      "name" : "stage2_1\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "stage2_0\/sum",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage2_1\/conv2",
      "blob_weights" : 35,
      "K" : 44,
      "blob_biases" : 33,
      "name" : "stage2_1\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "stage2_1\/conv1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "stage2_1\/conv2,stage2_0\/sum",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "stage2_1\/sum",
      "type" : "elementwise",
      "name" : "stage2_1\/sum",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage3_0\/conv1",
      "blob_weights" : 39,
      "K" : 44,
      "blob_biases" : 37,
      "stride_x" : 2,
      "name" : "stage3_0\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 52,
      "bottom" : "stage2_1\/sum",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage3_0\/conv2",
      "blob_weights" : 43,
      "K" : 52,
      "blob_biases" : 41,
      "name" : "stage3_0\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 52,
      "bottom" : "stage3_0\/conv1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage3\/downsample",
      "blob_weights" : 47,
      "K" : 44,
      "blob_biases" : 45,
      "stride_x" : 2,
      "name" : "stage3\/downsample",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 52,
      "bottom" : "stage2_1\/sum",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "stage3_0\/conv2,stage3\/downsample",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "stage3_0\/sum",
      "type" : "elementwise",
      "name" : "stage3_0\/sum",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage3_1\/conv1",
      "blob_weights" : 51,
      "K" : 52,
      "blob_biases" : 49,
      "name" : "stage3_1\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 52,
      "bottom" : "stage3_0\/sum",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage3_1\/conv2",
      "blob_weights" : 55,
      "K" : 52,
      "blob_biases" : 53,
      "name" : "stage3_1\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 52,
      "bottom" : "stage3_1\/conv1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "stage3_1\/conv2,stage3_0\/sum",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "stage3_1\/sum",
      "type" : "elementwise",
      "name" : "stage3_1\/sum",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage3_2\/conv1",
      "blob_weights" : 59,
      "K" : 52,
      "blob_biases" : 57,
      "name" : "stage3_2\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 52,
      "bottom" : "stage3_1\/sum",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage3_2\/conv2",
      "blob_weights" : 63,
      "K" : 52,
      "blob_biases" : 61,
      "name" : "stage3_2\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 52,
      "bottom" : "stage3_2\/conv1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "stage3_2\/conv2,stage3_1\/sum",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "stage3_2\/sum",
      "type" : "elementwise",
      "name" : "stage3_2\/sum",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "upsampling",
      "blob_weights" : 65,
      "K" : 52,
      "stride_x" : 2,
      "name" : "upsampling",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 52,
      "pad_t" : 1,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 52,
      "bottom" : "stage3_2\/sum",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "before_add",
      "blob_weights" : 69,
      "K" : 52,
      "blob_biases" : 67,
      "name" : "before_add",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "upsampling",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "stage2_1\/sum,before_add",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "Eltwise1",
      "type" : "elementwise",
      "name" : "Eltwise1",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage1\/2nd\/0\/dw",
      "blob_weights" : 73,
      "K" : 44,
      "blob_biases" : 71,
      "name" : "feature_stage1\/2nd\/0\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "Eltwise1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage1\/2nd\/0\/pw",
      "blob_weights" : 77,
      "K" : 44,
      "blob_biases" : 75,
      "name" : "feature_stage1\/2nd\/0\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage1\/2nd\/0\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage1\/2nd\/1\/dw",
      "blob_weights" : 81,
      "K" : 44,
      "blob_biases" : 79,
      "name" : "feature_stage1\/2nd\/1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage1\/2nd\/0\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage1\/2nd\/1\/pw",
      "blob_weights" : 85,
      "K" : 44,
      "blob_biases" : 83,
      "name" : "feature_stage1\/2nd\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage1\/2nd\/1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage1\/2nd\/2\/dw",
      "blob_weights" : 89,
      "K" : 44,
      "blob_biases" : 87,
      "name" : "feature_stage1\/2nd\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage1\/2nd\/1\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage1\/2nd\/2\/pw",
      "blob_weights" : 93,
      "K" : 44,
      "blob_biases" : 91,
      "name" : "feature_stage1\/2nd\/2\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage1\/2nd\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage1\/2nd\/3\/dw",
      "blob_weights" : 97,
      "K" : 44,
      "blob_biases" : 95,
      "name" : "feature_stage1\/2nd\/3\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage1\/2nd\/2\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage1\/2nd\/3\/pw",
      "blob_weights" : 101,
      "K" : 44,
      "blob_biases" : 99,
      "name" : "feature_stage1\/2nd\/3\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage1\/2nd\/3\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage1\/2nd\/4\/dw",
      "blob_weights" : 105,
      "K" : 44,
      "blob_biases" : 103,
      "name" : "feature_stage1\/2nd\/4\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage1\/2nd\/3\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage1\/2nd\/4\/pw",
      "blob_weights" : 109,
      "K" : 44,
      "blob_biases" : 107,
      "name" : "feature_stage1\/2nd\/4\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage1\/2nd\/4\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "main\/layer_combine1",
      "type" : "concat",
      "name" : "main\/layer_combine1",
      "bottom" : "Eltwise1,feature_stage1\/2nd\/4\/pw"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage2\/2nd\/0\/dw",
      "blob_weights" : 113,
      "K" : 88,
      "blob_biases" : 111,
      "name" : "feature_stage2\/2nd\/0\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 88,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 88,
      "bottom" : "main\/layer_combine1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage2\/2nd\/0\/pw",
      "blob_weights" : 117,
      "K" : 88,
      "blob_biases" : 115,
      "name" : "feature_stage2\/2nd\/0\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage2\/2nd\/0\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage2\/2nd\/1\/dw",
      "blob_weights" : 121,
      "K" : 44,
      "blob_biases" : 119,
      "name" : "feature_stage2\/2nd\/1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage2\/2nd\/0\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage2\/2nd\/1\/pw",
      "blob_weights" : 125,
      "K" : 44,
      "blob_biases" : 123,
      "name" : "feature_stage2\/2nd\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage2\/2nd\/1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage2\/2nd\/2\/dw",
      "blob_weights" : 129,
      "K" : 44,
      "blob_biases" : 127,
      "name" : "feature_stage2\/2nd\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage2\/2nd\/1\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage2\/2nd\/2\/pw",
      "blob_weights" : 133,
      "K" : 44,
      "blob_biases" : 131,
      "name" : "feature_stage2\/2nd\/2\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage2\/2nd\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage2\/2nd\/3\/dw",
      "blob_weights" : 137,
      "K" : 44,
      "blob_biases" : 135,
      "name" : "feature_stage2\/2nd\/3\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage2\/2nd\/2\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage2\/2nd\/3\/pw",
      "blob_weights" : 141,
      "K" : 44,
      "blob_biases" : 139,
      "name" : "feature_stage2\/2nd\/3\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage2\/2nd\/3\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage2\/2nd\/4\/dw",
      "blob_weights" : 145,
      "K" : 44,
      "blob_biases" : 143,
      "name" : "feature_stage2\/2nd\/4\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage2\/2nd\/3\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage2\/2nd\/4\/pw",
      "blob_weights" : 149,
      "K" : 44,
      "blob_biases" : 147,
      "name" : "feature_stage2\/2nd\/4\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage2\/2nd\/4\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "main\/layer_combine2",
      "type" : "concat",
      "name" : "main\/layer_combine2",
      "bottom" : "Eltwise1,feature_stage2\/2nd\/4\/pw"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage3\/2nd\/0\/dw",
      "blob_weights" : 153,
      "K" : 88,
      "blob_biases" : 151,
      "name" : "feature_stage3\/2nd\/0\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 88,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 88,
      "bottom" : "main\/layer_combine2",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage3\/2nd\/0\/pw",
      "blob_weights" : 157,
      "K" : 88,
      "blob_biases" : 155,
      "name" : "feature_stage3\/2nd\/0\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage3\/2nd\/0\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage3\/2nd\/1\/dw",
      "blob_weights" : 161,
      "K" : 44,
      "blob_biases" : 159,
      "name" : "feature_stage3\/2nd\/1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage3\/2nd\/0\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage3\/2nd\/1\/pw",
      "blob_weights" : 165,
      "K" : 44,
      "blob_biases" : 163,
      "name" : "feature_stage3\/2nd\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage3\/2nd\/1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage3\/2nd\/2\/dw",
      "blob_weights" : 169,
      "K" : 44,
      "blob_biases" : 167,
      "name" : "feature_stage3\/2nd\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage3\/2nd\/1\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage3\/2nd\/2\/pw",
      "blob_weights" : 173,
      "K" : 44,
      "blob_biases" : 171,
      "name" : "feature_stage3\/2nd\/2\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage3\/2nd\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage3\/2nd\/3\/dw",
      "blob_weights" : 177,
      "K" : 44,
      "blob_biases" : 175,
      "name" : "feature_stage3\/2nd\/3\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage3\/2nd\/2\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage3\/2nd\/3\/pw",
      "blob_weights" : 181,
      "K" : 44,
      "blob_biases" : 179,
      "name" : "feature_stage3\/2nd\/3\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage3\/2nd\/3\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage3\/2nd\/4\/dw",
      "blob_weights" : 185,
      "K" : 44,
      "blob_biases" : 183,
      "name" : "feature_stage3\/2nd\/4\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage3\/2nd\/3\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage3\/2nd\/4\/pw",
      "blob_weights" : 189,
      "K" : 44,
      "blob_biases" : 187,
      "name" : "feature_stage3\/2nd\/4\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage3\/2nd\/4\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "main\/layer_combine3",
      "type" : "concat",
      "name" : "main\/layer_combine3",
      "bottom" : "Eltwise1,feature_stage3\/2nd\/4\/pw"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage4\/2nd\/0\/dw",
      "blob_weights" : 193,
      "K" : 88,
      "blob_biases" : 191,
      "name" : "feature_stage4\/2nd\/0\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 88,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 88,
      "bottom" : "main\/layer_combine3",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage4\/2nd\/0\/pw",
      "blob_weights" : 197,
      "K" : 88,
      "blob_biases" : 195,
      "name" : "feature_stage4\/2nd\/0\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage4\/2nd\/0\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage4\/2nd\/1\/dw",
      "blob_weights" : 201,
      "K" : 44,
      "blob_biases" : 199,
      "name" : "feature_stage4\/2nd\/1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage4\/2nd\/0\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage4\/2nd\/1\/pw",
      "blob_weights" : 205,
      "K" : 44,
      "blob_biases" : 203,
      "name" : "feature_stage4\/2nd\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage4\/2nd\/1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage4\/2nd\/2\/dw",
      "blob_weights" : 209,
      "K" : 44,
      "blob_biases" : 207,
      "name" : "feature_stage4\/2nd\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage4\/2nd\/1\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage4\/2nd\/2\/pw",
      "blob_weights" : 213,
      "K" : 44,
      "blob_biases" : 211,
      "name" : "feature_stage4\/2nd\/2\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage4\/2nd\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage4\/2nd\/3\/dw",
      "blob_weights" : 217,
      "K" : 44,
      "blob_biases" : 215,
      "name" : "feature_stage4\/2nd\/3\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage4\/2nd\/2\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage4\/2nd\/3\/pw",
      "blob_weights" : 221,
      "K" : 44,
      "blob_biases" : 219,
      "name" : "feature_stage4\/2nd\/3\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage4\/2nd\/3\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage4\/2nd\/4\/dw",
      "blob_weights" : 225,
      "K" : 44,
      "blob_biases" : 223,
      "name" : "feature_stage4\/2nd\/4\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage4\/2nd\/3\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage4\/2nd\/4\/pw",
      "blob_weights" : 229,
      "K" : 44,
      "blob_biases" : 227,
      "name" : "feature_stage4\/2nd\/4\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "feature_stage4\/2nd\/4\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage4_regression\/2nd\/final_240feature_stage4_regression2nd\/sigmoid",
      "blob_weights" : 233,
      "K" : 44,
      "blob_biases" : 231,
      "name" : "feature_stage4_regression\/2nd\/final",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "feature_stage4\/2nd\/4\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 3,
      "weights" : {

      },
      "top" : "feature_stage4_regression\/2nd\/final",
      "type" : "activation",
      "name" : "feature_stage4_regression2nd\/sigmoid",
      "bottom" : "feature_stage4_regression\/2nd\/final_240feature_stage4_regression2nd\/sigmoid"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "box_dpconv1\/dw",
      "blob_weights" : 237,
      "K" : 44,
      "blob_biases" : 235,
      "stride_x" : 2,
      "name" : "box_dpconv1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "Eltwise1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "box_dpconv1\/pw",
      "blob_weights" : 241,
      "K" : 44,
      "blob_biases" : 239,
      "name" : "box_dpconv1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "box_dpconv1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "box_dpconv2\/dw",
      "blob_weights" : 245,
      "K" : 32,
      "blob_biases" : 243,
      "stride_x" : 2,
      "name" : "box_dpconv2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "box_dpconv1\/pw",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "box_dpconv2\/pw",
      "blob_weights" : 249,
      "K" : 32,
      "blob_biases" : 247,
      "name" : "box_dpconv2\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "box_dpconv2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 0,
      "stride_x" : 1,
      "pad_mode" : 0,
      "stride_y" : 1,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 5,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 5,
      "pad_fill_mode" : 0,
      "bottom" : "box_dpconv2\/pw",
      "pad_l" : 0,
      "name" : "box_avg",
      "top" : "box_avg"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "box_fc",
      "blob_weights" : 253,
      "K" : 16,
      "blob_biases" : 251,
      "name" : "box_fc",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "box_avg",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    }
  ]
}